Revit 2024 API
BuiltInFailures.ConnectorFailures.FittingMustBeOnPipeWarn Property
 The [Tap] must be attached to pipe.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FittingMustBeOnPipeWarn { get; }
Visual Basic
Public Shared ReadOnly Property FittingMustBeOnPipeWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FittingMustBeOnPipeWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace